serving/results/llama_qwen_variants/logs/benchmarks/sandhi__models_qwen2_5_coder_7b_instruct.log

==================================
Running benchmarks (sandhi / qwen)
==================================

==================================
Target: qwen
Port: 12306
Model: /variants_sc/Qwen2.5-Coder-7B-Instruct
==================================
RPS=25
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 22:53:47][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 22:53:48 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 22:53:51][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 22:53:51][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 22:53:54.577000 26226 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 22:53:54.577000 26226 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 22:53:55][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 22:53:55][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 22:53:55][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 22:53:55][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7daaaebbc680>, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/variants_sc/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=25.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 22:53:55 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 531:04:49 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 25.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 500/500 [00:32<00:00, 15.37it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Request rate configured (RPS):           25.00     
Benchmark duration (s):                  32.54     
Total input tokens:                      49932     
Total generated tokens:                  450000    
Request throughput (req/s):              15.37     
Output token throughput (tok/s):         13829.36  
Peak output token throughput (tok/s):    17214.00  
Peak concurrent requests:                378.00    
Total Token throughput (tok/s):          15363.87  
---------------Time to First Token----------------
Mean TTFT (ms):                          63.91     
Median TTFT (ms):                        53.23     
P95 TTFT (ms):                           105.86    
P99 TTFT (ms):                           368.25    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          16.35     
Median TPOT (ms):                        17.25     
P95 TPOT (ms):                           18.96     
P99 TPOT (ms):                           18.98     
---------------Inter-token Latency----------------
Mean ITL (ms):                           16.35     
Median ITL (ms):                         16.91     
P95 ITL (ms):                            22.26     
P99 ITL (ms):                            31.72     
==================================================
RPS=30
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 22:54:35][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 22:54:36 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 22:54:40][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 22:54:40][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 22:54:43.208000 26748 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 22:54:43.208000 26748 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 22:54:43][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 22:54:43][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 22:54:43][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 22:54:43][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x72f0dc5485e0>, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/variants_sc/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=30.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 22:54:44 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 558:32:14 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 30.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 500/500 [00:32<00:00, 15.26it/s] 
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Request rate configured (RPS):           30.00     
Benchmark duration (s):                  32.77     
Total input tokens:                      49932     
Total generated tokens:                  450000    
Request throughput (req/s):              15.26     
Output token throughput (tok/s):         13730.03  
Peak output token throughput (tok/s):    17237.00  
Peak concurrent requests:                430.00    
Total Token throughput (tok/s):          15253.52  
---------------Time to First Token----------------
Mean TTFT (ms):                          69.60     
Median TTFT (ms):                        51.78     
P95 TTFT (ms):                           109.50    
P99 TTFT (ms):                           579.29    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          19.42     
Median TPOT (ms):                        20.78     
P95 TPOT (ms):                           22.92     
P99 TPOT (ms):                           22.93     
---------------Inter-token Latency----------------
Mean ITL (ms):                           19.42     
Median ITL (ms):                         19.06     
P95 ITL (ms):                            27.10     
P99 ITL (ms):                            36.70     
==================================================
RPS=35
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 22:55:24][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 22:55:25 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 22:55:29][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 22:55:29][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 22:55:32.406000 27141 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 22:55:32.406000 27141 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 22:55:33][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 22:55:33][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 22:55:33][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 22:55:33][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x752bba148680>, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/variants_sc/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=35.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 22:55:33 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 596:51:15 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 35.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 500/500 [00:30<00:00, 16.21it/s] 
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Request rate configured (RPS):           35.00     
Benchmark duration (s):                  30.85     
Total input tokens:                      49932     
Total generated tokens:                  450000    
Request throughput (req/s):              16.21     
Output token throughput (tok/s):         14585.46  
Peak output token throughput (tok/s):    16775.00  
Peak concurrent requests:                462.00    
Total Token throughput (tok/s):          16203.86  
---------------Time to First Token----------------
Mean TTFT (ms):                          59.91     
Median TTFT (ms):                        56.87     
P95 TTFT (ms):                           112.90    
P99 TTFT (ms):                           139.56    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          20.10     
Median TPOT (ms):                        21.09     
P95 TPOT (ms):                           22.78     
P99 TPOT (ms):                           22.79     
---------------Inter-token Latency----------------
Mean ITL (ms):                           20.10     
Median ITL (ms):                         20.58     
P95 ITL (ms):                            32.14     
P99 ITL (ms):                            41.64     
==================================================
RPS=40
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 22:56:12][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 22:56:13 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 22:56:17][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 22:56:17][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 22:56:19.944000 27535 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 22:56:19.944000 27535 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 22:56:20][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 22:56:20][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 22:56:20][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 22:56:20][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f513d944680>, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/variants_sc/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=40.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 22:56:21 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 570:51:36 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 40.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 500/500 [00:30<00:00, 16.58it/s] 
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Request rate configured (RPS):           40.00     
Benchmark duration (s):                  30.15     
Total input tokens:                      49932     
Total generated tokens:                  450000    
Request throughput (req/s):              16.58     
Output token throughput (tok/s):         14924.53  
Peak output token throughput (tok/s):    17757.00  
Peak concurrent requests:                487.00    
Total Token throughput (tok/s):          16580.55  
---------------Time to First Token----------------
Mean TTFT (ms):                          65.50     
Median TTFT (ms):                        63.34     
P95 TTFT (ms):                           114.07    
P99 TTFT (ms):                           235.05    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          21.17     
Median TPOT (ms):                        22.01     
P95 TPOT (ms):                           23.49     
P99 TPOT (ms):                           23.51     
---------------Inter-token Latency----------------
Mean ITL (ms):                           21.17     
Median ITL (ms):                         22.17     
P95 ITL (ms):                            31.92     
P99 ITL (ms):                            40.64     
==================================================